cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'jhawthorn/fzy'
tap 'neovim/neovim'
tap 'homebrew/homebrew-php'

## CLI

brew 'git'
brew 'libgit2'
brew 'the_silver_searcher'
brew 'postgresql'
brew 'mysql'
brew 'redis'
brew 'phantomjs'
brew 'hub'
brew 'vim'
brew 'neovim'
brew 'ctags'
brew 'tmux'
brew 'htop'
brew 'reattach-to-user-namespace'
brew 'go'
brew 'fortune'
brew 'sl' # Corrects bad typing
brew 'tree'
brew 'yadm'
brew 'mas'
brew 'git-crypt'
brew 'zplug'
brew 'fzy'
brew 'fzf'
brew 'yarn'
brew 'fswatch'
brew 'unison'

## PHP

brew 'php71'
brew 'php71-pdo-pgsql'
brew 'php71-ssh2'
brew 'php71-intl'
brew 'php71-libsodium'
brew 'php71-mcrypt'

## Applications

cask 'google-chrome'
cask 'firefox'
cask 'cloud'
cask 'flux'
cask 'slack'
cask 'skype'
cask 'discord'
cask 'iterm2'
cask 'spectacle'
cask 'alfred'
cask 'atom'
cask 'intellij-idea'
cask 'razer-synapse'
cask 'spotify'
cask 'spotify-notifications'
cask 'dash'
cask 'gpgtools'
cask 'virtualbox'
cask 'tunnelblick'
cask 'hipchat'
cask 'lastpass'
cask 'veertu-desktop'
cask 'sequel-pro-nightly'
cask 'postico'
cask 'teamviewer'
cask 'docker'
cask 'the-unarchiver'

## Fonts

cask 'font-menlo-for-powerline'
cask 'font-monoid-nerd-font'
