cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'aws/tap'
tap 'adoptium/openjdk'
tap 'bazelbuild/tap'
tap 'robotsandpencils/made'

## CLI

brew 'coreutils'
brew 'gnu-sed'
brew 'neovim'
brew 'tmux'
brew 'htop'
brew 'reattach-to-user-namespace'
brew 'go'
brew 'tree'
brew 'diff-so-fancy'
brew 'jq'
brew 'yq'
brew 'gh'
brew 'nvim'
brew 'whalebrew'
brew 'yadm'
brew 'wget'
brew 'adr-tools'
brew 'httpie'
brew 'awscli'
brew 'azure-cli'
brew 'bazelisk'
brew 'ibazel'
brew 'git-credential-manager'
brew 'xcodes'
brew 'graphviz'
brew 'watchman'

## IaaC

brew 'checkov'
brew 'kics'
brew 'terraform'
brew 'terragrunt'
brew 'tflint'

## Languages

brew 'python@3.9'

## CLI - Fun
brew "sl" # Corrects bad typing
brew "asciiquarium"
brew "catimg"
brew "cmatrix"
brew "cowsay"
brew "figlet" # Banner-like program prints strings as ASCII art
brew "fortune"
brew "lolcat" # rainbow colored cat command

## CLI - Dockerized (Currently Playing around with)

# whalebrew 'whalebrew/awscli' # it's outdated
whalebrew 'tianon/speedtest'

# Docker for Mac appears to include kubectl
# whalebrew 'whalebrew/kubectl'

## Applications

cask 'kitty'
cask 'iterm2'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
cask 'docker'
cask 'brave-browser'
cask 'firefox'
cask 'slack'
cask 'discord'
cask 'spectacle'
cask 'alfred'
cask 'spotify'
cask 'gpg-suite-no-mail'
cask 'the-unarchiver'
cask '1password'
cask '1password-cli'
cask 'keepingyouawake'
cask 'setapp'
cask 'sequel-ace'
cask 'sonos'
cask 'signal'
cask 'sketch'
cask 'drawio'
cask 'gitkraken'
cask 'backblaze'
cask 'figma'
cask 'raycast'
cask 'cron'
cask 'session-manager-plugin'
cask 'zeplin'
cask 'whatapp'
cask 'temurin'

## Languages

cask 'dotnet-sdk'

## Workplace

cask 'microsoft-outlook'
cask 'microsoft-teams'
cask 'microsoft-auto-update'

## Fonts

cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-monoid-nerd-font'
